
#include "SettingIcon.h"

#include <Application/main.h>

//==========================================================
// 初期化
//==========================================================
void SettingIcon::Init()
{
	//---------------------------------------
	// 設定アイコン画像読み込み
	//---------------------------------------
	m_iconTex = std::make_shared<KdTexture>();

	m_iconTex->Load(
		"Asset/Textures/UI/Setting/SettingIcon.png"
	);

	//---------------------------------------
	// 初期表示
	//---------------------------------------
	m_visible = true;
}

//==========================================================
// スプライト描画
//==========================================================
void SettingIcon::DrawSprite()
{
	//---------------------------------------
	// 非表示なら描画しない
	//---------------------------------------
	if (!m_visible || !m_iconTex)
	{
		return;
	}

	//---------------------------------------
	// TAB設定アイコン
	//---------------------------------------
	KdShaderManager::Instance().m_spriteShader.DrawTex(
		m_iconTex.get(),
		m_posX,
		m_posY,
		m_size,
		m_size
	);
}